Repository: microbian-systems/SecretSharingDotNet
Catalog: src/Resources/ErrorMessages.*.resx
Languages: de_de

# MinimumSecurityLevelExceeded
source: Minimum security level not achieved!
de_de: Der minimale Sicherheitslevel wurde unterschritten!

source: Maximum security level exceeded!
de_de: Der maximale Sicherheitslevel wurde überschritten!

# MinNumberOfSharesLowerThanTwo
source: The minimum number of shares is lower than 2! Please set the minimum number of shares to 2 or higher.
de_de: Die minimale Anzahl an Teilgeheimnissen ist kleiner als 2! Bitte setze die minimale Anzahl an Teilgeheimnissen auf 2 oder höher.

# FinitePointsNotDistinct
source: Finite points (aka shares) are not distinct!
de_de: Die finiten Punkte (auch als Teilgeheimnis bekannt) sind nicht eindeutig!

# MaxSharesLowerThanMinShares
source: The pool secret would be irrecoverable, if you use these parameters, because the maximum number of shares is lower than the minimum number of shares.
de_de: Das Pool-Geheimnis wäre mit diesen Parametern unwiederbringlich, da die maximale Anzahl an Teilgeheimnissen kleiner ist als die minimale Anzahl an Teilgeheimnissen.

# ReadOnlyCollection
source: The {0} collection is read-only.
de_de: Die {0}-Sammlung ist schreibgeschützt.

# StartArrayIndexNegative
source: The starting array index cannot be negative.
de_de: Der Start-Array-Index darf nicht negativ sein.

# DestinationArrayHasFewerElements
source: The destination array has fewer elements than the collection.
de_de: Das Zielarray hat weniger Elemente als die Sammlung.

# InvalidArrayTypeCast
source: Parameter {0}: Cannot convert an array of type {1} to an array of type {2}.
de_de: Parameter {0}: Ein Array vom Typ {1} kann nicht in ein Array vom Typ {2} konvertiert werden.

# EmptyCollection
source: Value cannot be an empty collection.
de_de: Der Wert darf keine leere Sammlung sein.

# ValueLowerThanX
source: Value cannot be lower than {0}.
de_de: Der Wert darf nicht kleiner als {0} sein.

# DataTypeNotSupported
source: Data Type '{0}' not supported!
de_de: Der Datentyp '{0}' wird nicht unterstützt!
